[
  {
    "pageName": "Genders",
    "tags": [
      "gender",
      "noun",
      "masculine",
      "feminine",
      "neuter",
      "der",
      "die",
      "das"
    ],
    "headings": [
      {
        "title": "Genders (Die Geschlechter)",
        "paragraphs": [
          "Nouns in germans have genders. German has three genders in its grammar:",
          "The above list doesn't represent the genders, but rather how the definite articles behave with each gender.",
          "Noun gender is a linguistic category that may not necessarily reflect the biological or social association of a gender as a human might perceive it. A good example of this is the word \"Das Mädchen\" (the girl) which might make sense to use Die instead of Das, but isn't because German do be like that sometimes.",
          "Said differently, just because a noun is \"feminine\" or \"masculine\" to human norms, doesn't mean it's going to match the gender in german, although much of the time, it does (e.g. The Woman = Die Frau)."
        ],
        "href": "/Genders/Genders#genders-die-geschlechter"
      },
      {
        "title": "Examples:",
        "paragraphs": [],
        "href": "/Genders/Genders#examples"
      },
      {
        "title": "Telling the difference",
        "paragraphs": [
          "Although many methods exist out there to tell the gender of a word, they aren't 100% accurate, so realistically you'll have to memorize a lot of words and then rely on your gut to tell you the gender of any given word. This is something that happens after you've learned a sufficient number of words and you'll feel more confident in your guesses as time goes on.",
          "Even native german speakers have trouble using the correct gender sometimes, so that should tell you something.",
          "Regardless, there are a few methods that help with this. I recommend this video for that: How to know a word's gender | Super Easy German"
        ],
        "href": "/Genders/Genders#telling-the-difference"
      },
      {
        "title": "Gender and Articles",
        "paragraphs": [
          "Definite and Indefinite articles change based on grammatical case and gender:"
        ],
        "href": "/Genders/Genders#gender-and-articles"
      },
      {
        "title": "Definite Articles Table",
        "paragraphs": [
          "| Article | Nominative | Accusative | Dative | Genitive | | ------- | ---------- | ---------- | ------ | -------- | | Der     | Der        | Den        | Dem    | Des      | | Die     | Die        | Die        | Der    | Der      | | Das     | Das        | Das        | Dem    | Des      |"
        ],
        "href": "/Genders/Genders#definite-articles-table"
      },
      {
        "title": "Indefinite Articles Table",
        "paragraphs": [
          "| Article | Nominative | Accusative | Dative | Genitive | | ------- | ---------- | ---------- | ------ | -------- | | Ein     | Ein        | Einen      | Einem  | Eines    | | Eine    | Eine       | Eine       | Einer  | Einer    | | Ein (N) | Ein        | Ein        | Einem  | Eines    |"
        ],
        "href": "/Genders/Genders#indefinite-articles-table"
      }
    ]
  },
  {
    "pageName": "Getting Started",
    "tags": [
      "start",
      "begin",
      "help"
    ],
    "headings": [
      {
        "title": "Getting Started",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#getting-started"
      },
      {
        "title": "Determining Your Level",
        "paragraphs": [
          "Knowing your level in German is the first step to knowing what to focus on next."
        ],
        "href": "/Hello-World/Getting-Started#determining-your-level"
      },
      {
        "title": "Starting From Scratch",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#starting-from-scratch"
      },
      {
        "title": "Improving Existing Knowledge",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#improving-existing-knowledge"
      },
      {
        "title": "Using the Search",
        "paragraphs": [
          "The search is still in development. When finished, it'll enable you to find any resource on the website with ease, including the context and page which it is found in.",
          "You will also be able to see your recent searches as well as favorite searches which you access frequently."
        ],
        "href": "/Hello-World/Getting-Started#using-the-search"
      }
    ]
  },
  {
    "pageName": "Roadmap",
    "headings": [
      {
        "title": "Roadmap",
        "paragraphs": [
          "While this site is meant as a general reference which anyone can use, there are some concepts which can be associated with a higher priorty due to being more common in everyday speech and increase in ability of expressivness.",
          "With that in mind, the following could be considered depending on what level you consider yourself to be:"
        ],
        "href": "/Hello-World/Roadmap#roadmap"
      }
    ]
  },
  {
    "pageName": "The Alphabet",
    "tags": [
      "abc",
      "the abcs",
      "letters",
      "umlaut"
    ],
    "headings": [
      {
        "title": "The German Alphabet",
        "paragraphs": [],
        "href": "/Hello-World/The-Alphabet#the-german-alphabet"
      },
      {
        "title": "The Standard Alphabet",
        "paragraphs": [
          "The Alphabet in German is very similar to its English counterpart, with a few exceptions to how letters are pronounced and a few extra letters.",
          "It's highly recommended that you listen to it being pronounced to get a better grasp. If you have trouble pronouncing a letter then it's not the end of the world and you shouldn't stress about it too much. You will pick it up with time as you learn more vocabulary and start having conversations.",
          "This video can help with learning the pronounciation of many letters",
          "You have your usual A -> Z (pronounciation links included for each):",
          "Notable differences in letter names (compared to English) are:"
        ],
        "href": "/Hello-World/The-Alphabet#the-standard-alphabet"
      },
      {
        "title": "Special Letters",
        "paragraphs": [
          "The German language has 3 special letters called Umlaute:",
          "The two-dot symbol (¨) on top of the previous letters is called an umlaut, hence the name.",
          "There is also another well-known special letter called the eszett or scharfes S (Sharp S):",
          "An interesting thing to know about this letter is that there are no words that start with it."
        ],
        "href": "/Hello-World/The-Alphabet#special-letters"
      },
      {
        "title": "A different method of writing special letters",
        "paragraphs": [
          "Understandably, you may find yourself ignoring the Umlaute while starting out since they are not easy to write on a US Qwery layout keyboard. Nevertheless, you should be aware that changing an umlaut to a non-umlaut in a word could change its meaning completely.",
          "In short: don't simply convert an umlaut to a non-umlaut while writing a word as that could change the meaning of the word entirely.",
          "Luckily, there is a compromise.",
          "In German, if you can't type or write special characters like ä, ö, ü, or ß, there's a workaround. For the umlauted vowels, you can replace them with \"ae,\" \"oe,\" or \"ue,\" known as \"Umlaut Ersatz.\"",
          "Similarly, the sharp S (ß) can be swapped with \"ss,\" called \"Eszett Ersatz.\"",
          "You can see examples here"
        ],
        "href": "/Hello-World/The-Alphabet#a-different-method-of-writing-special-letters"
      }
    ]
  },
  {
    "pageName": "Articles",
    "tags": [
      "articles",
      "der",
      "die",
      "das",
      "ein",
      "eine",
      "einen",
      "einem",
      "eines"
    ],
    "headings": [
      {
        "title": "Articles",
        "paragraphs": [
          "Articles are words put before other words to make those words mean something. Latin-based languages are really fond of this.",
          "There are two main types of articles which you need to know about in german:"
        ],
        "href": "/The-Tivs/Articles#articles"
      },
      {
        "title": "The Definite Articles",
        "paragraphs": [],
        "href": "/The-Tivs/Articles#the-definite-articles"
      },
      {
        "title": "The Indefinite Articles",
        "paragraphs": [],
        "href": "/The-Tivs/Articles#the-indefinite-articles"
      }
    ]
  },
  {
    "pageName": "The Accusative",
    "headings": [
      {
        "title": "The Accusative",
        "paragraphs": [
          "The accusative in german means when you're targeting something in your verb, not as the recipient of an action but more so as the affected entity.",
          "Accusative causes articles to change into different forms.",
          "Example:"
        ],
        "href": "/The-Tivs/The-Accusative#the-accusative"
      }
    ]
  },
  {
    "pageName": "The Dative",
    "headings": [
      {
        "title": "The Dative",
        "paragraphs": [],
        "href": "/The-Tivs/The-Dative#the-dative"
      }
    ]
  },
  {
    "pageName": "The Genitive",
    "headings": [
      {
        "title": "The Genitive",
        "paragraphs": [],
        "href": "/The-Tivs/The-Genitive#the-genitive"
      }
    ]
  },
  {
    "pageName": "The Nominative",
    "headings": [
      {
        "title": "The Nominative",
        "paragraphs": [],
        "href": "/The-Tivs/The-Nominative#the-nominative"
      }
    ]
  }
]