[
  {
    "pageName": "Getting Started",
    "tags": [
      "start",
      "begin",
      "help"
    ],
    "headings": [
      {
        "title": "Getting Started",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#getting-started"
      },
      {
        "title": "Determining Your Level",
        "paragraphs": [
          "Knowing your level in German is the first step to knowing what to focus on next."
        ],
        "href": "/Hello-World/Getting-Started#determining-your-level"
      },
      {
        "title": "Starting From Scratch",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#starting-from-scratch"
      },
      {
        "title": "Improving Existing Knowledge",
        "paragraphs": [],
        "href": "/Hello-World/Getting-Started#improving-existing-knowledge"
      },
      {
        "title": "Using the Search",
        "paragraphs": [
          "The search is still in development. When finished, it'll enable you to find any resource on the website with ease, including the context and page which it is found in.",
          "You will also be able to see your recent searches as well as favorite searches which you access frequently."
        ],
        "href": "/Hello-World/Getting-Started#using-the-search"
      }
    ]
  },
  {
    "pageName": "Roadmap",
    "headings": [
      {
        "title": "Roadmap",
        "paragraphs": [
          "While this site is meant as a general reference which anyone can use, there are some concepts which can be associated with a higher priorty due to being more common in everyday speech and increase in ability of expressivness.",
          "With that in mind, the following could be considered depending on what level you consider yourself to be:"
        ],
        "href": "/Hello-World/Roadmap#roadmap"
      }
    ]
  },
  {
    "pageName": "The Alphabet",
    "tags": [
      "abc",
      "the abcs",
      "letters",
      "competely irrelevant tag"
    ],
    "headings": [
      {
        "title": "The German Alphabet",
        "paragraphs": [
          "The Alphabet in German is very similar to its English counterpart, with a few exceptions to how letters are pronounced and a few extra letters."
        ],
        "href": "/Hello-World/The-Alphabet#the-german-alphabet"
      },
      {
        "title": "The Alphabet",
        "paragraphs": [
          "Though the German alphabet will be listed below, it's highly recommended that you listen to it being pronounced to get a better grasp. Pronouncing letters correctly is not something you should pay too much attention to in the beginning as you will pick it up with time as you learn more vocabulary and start having conversations.",
          "I personally watched this video on youtube to learn the pronounciation of many of the letters, once: Link",
          "Special Chars: ü, ö, ä, ß (eszett)"
        ],
        "href": "/Hello-World/The-Alphabet#the-alphabet"
      }
    ]
  }
]